Revit 2026 API

# ParameterTypeIdStairsCurveType Property

---

"Stairs Line Type"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId StairsCurveType { get; }
```
```vb
Public Shared ReadOnly Property StairsCurveType As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ StairsCurveType {
	ForgeTypeId^ get ();
}
```
```fsharp
static member StairsCurveType : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace